https://www.r-project.org/
r语言实战
R语言数据分析与挖掘实战
# 
像Python一样优雅的用R https://zhuanlan.zhihu.com/p/27592751
# 
R：
是什么：专门用于统计分析的编程语言
具体可以做什么：数据清洗，数据分析，可视化，建模，编程能力
目的是为了提高工作效率

常量
单引号，双引号是一样的
class(a) 查看数据类型
<- 与 = 没有区别，但推荐<-
函数 mf <- function(x){x+5} mf(1)
判断语句
循环语句
函数

数据结构
数据读取与存储
数据处理
 
1:4 打印1到4
向量 v <- c(1,2,3,'a') c是combine的意思，生成vector
矩阵 m <- matrix(1:50,nrow=10,ncol=5) 二维 数据类型必须一致
m[1,c(1,2)] 查询第1行1和2列数据 数据类型必须一致
数组 a <- array(1:30,c(3,5,2)) 数据类型必须一致
dataframe 二维 按列数据类型可以不一致 最常用的 d$col 选取指定的列
list 可以存放任意类型的数据
factor 是非数值型的数据
? sum(is.na(d)) 方法与函数

